MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB410/mcu.h
/* U6TXREG */
/* Bitname _LAST cannot be defined because it is used by more than one SFR */

/* U6ADMD */
/* Bitname _ADMADDR cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR6 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR7 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK6 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK7 cannot be defined because it is used by more than one SFR */

/* SPI1CON1 */
/* Bitname _ENHBUF cannot be defined because it is used by more than one SFR */
/* Bitname _SPIFE cannot be defined because it is used by more than one SFR */
/* Bitname _MCLKEN cannot be defined because it is used by more than one SFR */
/* Bitname _DISSCK cannot be defined because it is used by more than one SFR */
/* Bitname _DISSDI cannot be defined because it is used by more than one SFR */
/* Bitname _MSTEN cannot be defined because it is used by more than one SFR */
/* Bitname _CKP cannot be defined because it is used by more than one SFR */
/* Bitname _SSEN cannot be defined because it is used by more than one SFR */
/* Bitname _CKE cannot be defined because it is used by more than one SFR */
/* Bitname _SMP cannot be defined because it is used by more than one SFR */
/* Bitname _MODE16 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE32 cannot be defined because it is used by more than one SFR */
/* Bitname _DISSDO cannot be defined because it is used by more than one SFR */
/* Bitname _SPISIDL cannot be defined because it is used by more than one SFR */
/* Bitname _SPIEN cannot be defined because it is used by more than one SFR */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */

/* SPI1CON1H */
/* Bitname _FRMCNT cannot be defined because it is used by more than one SFR */
/* Bitname _FRMSYPW cannot be defined because it is used by more than one SFR */
/* Bitname _MSSEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMPOL cannot be defined because it is used by more than one SFR */
/* Bitname _FRMSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _FRMEN cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD cannot be defined because it is used by more than one SFR */
/* Bitname _URDTEN cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMONO cannot be defined because it is used by more than one SFR */
/* Bitname _IGNTUR cannot be defined because it is used by more than one SFR */
/* Bitname _IGNROV cannot be defined because it is used by more than one SFR */
/* Bitname _SPISGNEXT cannot be defined because it is used by more than one SFR */
/* Bitname _AUDEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT0 cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT1 cannot be defined because it is used by more than one SFR */
/* Bitname _FRMCNT2 cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD0 cannot be defined because it is used by more than one SFR */
/* Bitname _AUDMOD1 cannot be defined because it is used by more than one SFR */

/* SPI1CON2L */
/* Bitname _WLENGTH cannot be defined because it is used by more than one SFR */

/* SPI1STATL */
/* Bitname _SPIRBF cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBF cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBE cannot be defined because it is used by more than one SFR */
/* Bitname _SPIRBE cannot be defined because it is used by more than one SFR */
/* Bitname _SPIROV cannot be defined because it is used by more than one SFR */
/* Bitname _SRMT cannot be defined because it is used by more than one SFR */
/* Bitname _SPITUR cannot be defined because it is used by more than one SFR */
/* Bitname _SPIBUSY cannot be defined because it is used by more than one SFR */
/* Bitname _FRMERR cannot be defined because it is used by more than one SFR */

/* SPI1STATH */
/* Bitname _TXELM cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM5 cannot be defined because it is used by more than one SFR */

/* SPI1BUFL */
#define _SPI1BUFL SPI1BUFLbits.SPI1BUFL
/* Bitname _DATA cannot be defined because it is used by more than one SFR */

/* SPI1BUFH */
#define _SPI1BUFH SPI1BUFHbits.SPI1BUFH
/* Bitname _DATA cannot be defined because it is used by more than one SFR */

/* SPI1BRGL */
#define _SPI1BRGL SPI1BRGLbits.SPI1BRGL
/* Bitname _BRG cannot be defined because it is used by more than one SFR */

/* SPI1IMSK1 */
/* Bitname _SPIRBFEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBFEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPIRBEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPIROVEN cannot be defined because it is used by more than one SFR */
/* Bitname _SRMTEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITUREN cannot be defined because it is used by more than one SFR */
/* Bitname _BUSYEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMERREN cannot be defined because it is used by more than one SFR */

