MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB410/mcu.h
#define _IOCPUA_IOCPA4_POSITION                  0x00000004
#define _IOCPUA_IOCPA4_MASK                      0x00000010
#define _IOCPUA_IOCPA4_LENGTH                    0x00000001

#define _IOCPUA_IOCPA5_POSITION                  0x00000005
#define _IOCPUA_IOCPA5_MASK                      0x00000020
#define _IOCPUA_IOCPA5_LENGTH                    0x00000001

#define _IOCPUA_IOCPA6_POSITION                  0x00000006
#define _IOCPUA_IOCPA6_MASK                      0x00000040
#define _IOCPUA_IOCPA6_LENGTH                    0x00000001

#define _IOCPUA_IOCPA7_POSITION                  0x00000007
#define _IOCPUA_IOCPA7_MASK                      0x00000080
#define _IOCPUA_IOCPA7_LENGTH                    0x00000001

#define _IOCPUA_IOCPA9_POSITION                  0x00000009
#define _IOCPUA_IOCPA9_MASK                      0x00000200
#define _IOCPUA_IOCPA9_LENGTH                    0x00000001

#define _IOCPUA_IOCPA10_POSITION                 0x0000000A
#define _IOCPUA_IOCPA10_MASK                     0x00000400
#define _IOCPUA_IOCPA10_LENGTH                   0x00000001

#define _IOCPUA_IOCPA14_POSITION                 0x0000000E
#define _IOCPUA_IOCPA14_MASK                     0x00004000
#define _IOCPUA_IOCPA14_LENGTH                   0x00000001

#define _IOCPUA_IOCPA15_POSITION                 0x0000000F
#define _IOCPUA_IOCPA15_MASK                     0x00008000
#define _IOCPUA_IOCPA15_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA0_POSITION                 0x00000000
#define _IOCPUA_IOCPUA0_MASK                     0x00000001
#define _IOCPUA_IOCPUA0_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA1_POSITION                 0x00000001
#define _IOCPUA_IOCPUA1_MASK                     0x00000002
#define _IOCPUA_IOCPUA1_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA2_POSITION                 0x00000002
#define _IOCPUA_IOCPUA2_MASK                     0x00000004
#define _IOCPUA_IOCPUA2_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA3_POSITION                 0x00000003
#define _IOCPUA_IOCPUA3_MASK                     0x00000008
#define _IOCPUA_IOCPUA3_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA4_POSITION                 0x00000004
#define _IOCPUA_IOCPUA4_MASK                     0x00000010
#define _IOCPUA_IOCPUA4_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA5_POSITION                 0x00000005
#define _IOCPUA_IOCPUA5_MASK                     0x00000020
#define _IOCPUA_IOCPUA5_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA6_POSITION                 0x00000006
#define _IOCPUA_IOCPUA6_MASK                     0x00000040
#define _IOCPUA_IOCPUA6_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA7_POSITION                 0x00000007
#define _IOCPUA_IOCPUA7_MASK                     0x00000080
#define _IOCPUA_IOCPUA7_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA9_POSITION                 0x00000009
#define _IOCPUA_IOCPUA9_MASK                     0x00000200
#define _IOCPUA_IOCPUA9_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA10_POSITION                0x0000000A
#define _IOCPUA_IOCPUA10_MASK                    0x00000400
#define _IOCPUA_IOCPUA10_LENGTH                  0x00000001

#define _IOCPUA_IOCPUA14_POSITION                0x0000000E
#define _IOCPUA_IOCPUA14_MASK                    0x00004000
#define _IOCPUA_IOCPUA14_LENGTH                  0x00000001

#define _IOCPUA_IOCPUA15_POSITION                0x0000000F
#define _IOCPUA_IOCPUA15_MASK                    0x00008000
#define _IOCPUA_IOCPUA15_LENGTH                  0x00000001

#define _IOCPUA_CNPUA0_POSITION                  0x00000000
#define _IOCPUA_CNPUA0_MASK                      0x00000001
#define _IOCPUA_CNPUA0_LENGTH                    0x00000001

#define _IOCPUA_CNPUA1_POSITION                  0x00000001
#define _IOCPUA_CNPUA1_MASK                      0x00000002
#define _IOCPUA_CNPUA1_LENGTH                    0x00000001

#define _IOCPUA_CNPUA2_POSITION                  0x00000002
#define _IOCPUA_CNPUA2_MASK                      0x00000004
#define _IOCPUA_CNPUA2_LENGTH                    0x00000001

#define _IOCPUA_CNPUA3_POSITION                  0x00000003
#define _IOCPUA_CNPUA3_MASK                      0x00000008
#define _IOCPUA_CNPUA3_LENGTH                    0x00000001

#define _IOCPUA_CNPUA4_POSITION                  0x00000004
#define _IOCPUA_CNPUA4_MASK                      0x00000010
#define _IOCPUA_CNPUA4_LENGTH                    0x00000001

#define _IOCPUA_CNPUA5_POSITION                  0x00000005
#define _IOCPUA_CNPUA5_MASK                      0x00000020
#define _IOCPUA_CNPUA5_LENGTH                    0x00000001

#define _IOCPUA_CNPUA6_POSITION                  0x00000006
#define _IOCPUA_CNPUA6_MASK                      0x00000040
#define _IOCPUA_CNPUA6_LENGTH                    0x00000001

#define _IOCPUA_CNPUA7_POSITION                  0x00000007
#define _IOCPUA_CNPUA7_MASK                      0x00000080
#define _IOCPUA_CNPUA7_LENGTH                    0x00000001

#define _IOCPUA_CNPUA9_POSITION                  0x00000009
#define _IOCPUA_CNPUA9_MASK                      0x00000200
#define _IOCPUA_CNPUA9_LENGTH                    0x00000001

#define _IOCPUA_CNPUA10_POSITION                 0x0000000A
#define _IOCPUA_CNPUA10_MASK                     0x00000400
#define _IOCPUA_CNPUA10_LENGTH                   0x00000001

#define _IOCPUA_CNPUA14_POSITION                 0x0000000E
#define _IOCPUA_CNPUA14_MASK                     0x00004000
#define _IOCPUA_CNPUA14_LENGTH                   0x00000001

#define _IOCPUA_CNPUA15_POSITION                 0x0000000F
#define _IOCPUA_CNPUA15_MASK                     0x00008000
#define _IOCPUA_CNPUA15_LENGTH                   0x00000001

#define _CNPDA_IOCPDA0_POSITION                  0x00000000
#define _CNPDA_IOCPDA0_MASK                      0x00000001
#define _CNPDA_IOCPDA0_LENGTH                    0x00000001

#define _CNPDA_IOCPDA1_POSITION                  0x00000001
#define _CNPDA_IOCPDA1_MASK                      0x00000002
#define _CNPDA_IOCPDA1_LENGTH                    0x00000001

#define _CNPDA_IOCPDA2_POSITION                  0x00000002
#define _CNPDA_IOCPDA2_MASK                      0x00000004
#define _CNPDA_IOCPDA2_LENGTH                    0x00000001

#define _CNPDA_IOCPDA3_POSITION                  0x00000003
#define _CNPDA_IOCPDA3_MASK                      0x00000008
#define _CNPDA_IOCPDA3_LENGTH                    0x00000001

#define _CNPDA_IOCPDA4_POSITION                  0x00000004
#define _CNPDA_IOCPDA4_MASK                      0x00000010
#define _CNPDA_IOCPDA4_LENGTH                    0x00000001

#define _CNPDA_IOCPDA5_POSITION                  0x00000005
#define _CNPDA_IOCPDA5_MASK                      0x00000020
#define _CNPDA_IOCPDA5_LENGTH                    0x00000001

