MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB410/mcu.h
#define _RPINR22_SDI2R5_POSITION                 0x00000005
#define _RPINR22_SDI2R5_MASK                     0x00000020
#define _RPINR22_SDI2R5_LENGTH                   0x00000001

#define _RPINR22_SCK2R0_POSITION                 0x00000008
#define _RPINR22_SCK2R0_MASK                     0x00000100
#define _RPINR22_SCK2R0_LENGTH                   0x00000001

#define _RPINR22_SCK2R1_POSITION                 0x00000009
#define _RPINR22_SCK2R1_MASK                     0x00000200
#define _RPINR22_SCK2R1_LENGTH                   0x00000001

#define _RPINR22_SCK2R2_POSITION                 0x0000000A
#define _RPINR22_SCK2R2_MASK                     0x00000400
#define _RPINR22_SCK2R2_LENGTH                   0x00000001

#define _RPINR22_SCK2R3_POSITION                 0x0000000B
#define _RPINR22_SCK2R3_MASK                     0x00000800
#define _RPINR22_SCK2R3_LENGTH                   0x00000001

#define _RPINR22_SCK2R4_POSITION                 0x0000000C
#define _RPINR22_SCK2R4_MASK                     0x00001000
#define _RPINR22_SCK2R4_LENGTH                   0x00000001

#define _RPINR22_SCK2R5_POSITION                 0x0000000D
#define _RPINR22_SCK2R5_MASK                     0x00002000
#define _RPINR22_SCK2R5_LENGTH                   0x00000001

#define _RPINR23_SS2R_POSITION                   0x00000000
#define _RPINR23_SS2R_MASK                       0x0000003F
#define _RPINR23_SS2R_LENGTH                     0x00000006

#define _RPINR23_TXCKR_POSITION                  0x00000008
#define _RPINR23_TXCKR_MASK                      0x00003F00
#define _RPINR23_TXCKR_LENGTH                    0x00000006

#define _RPINR23_TXCRR_POSITION                  0x00000008
#define _RPINR23_TXCRR_MASK                      0x00003F00
#define _RPINR23_TXCRR_LENGTH                    0x00000006

#define _RPINR25_CLCINAR_POSITION                0x00000000
#define _RPINR25_CLCINAR_MASK                    0x0000003F
#define _RPINR25_CLCINAR_LENGTH                  0x00000006

#define _RPINR25_CLCINBR_POSITION                0x00000008
#define _RPINR25_CLCINBR_MASK                    0x00003F00
#define _RPINR25_CLCINBR_LENGTH                  0x00000006

#define _RPINR25_CLCINAR0_POSITION               0x00000000
#define _RPINR25_CLCINAR0_MASK                   0x00000001
#define _RPINR25_CLCINAR0_LENGTH                 0x00000001

#define _RPINR25_CLCINAR1_POSITION               0x00000001
#define _RPINR25_CLCINAR1_MASK                   0x00000002
#define _RPINR25_CLCINAR1_LENGTH                 0x00000001

#define _RPINR25_CLCINAR2_POSITION               0x00000002
#define _RPINR25_CLCINAR2_MASK                   0x00000004
#define _RPINR25_CLCINAR2_LENGTH                 0x00000001

#define _RPINR25_CLCINAR3_POSITION               0x00000003
#define _RPINR25_CLCINAR3_MASK                   0x00000008
#define _RPINR25_CLCINAR3_LENGTH                 0x00000001

#define _RPINR25_CLCINAR4_POSITION               0x00000004
#define _RPINR25_CLCINAR4_MASK                   0x00000010
#define _RPINR25_CLCINAR4_LENGTH                 0x00000001

#define _RPINR25_CLCINAR5_POSITION               0x00000005
#define _RPINR25_CLCINAR5_MASK                   0x00000020
#define _RPINR25_CLCINAR5_LENGTH                 0x00000001

#define _RPINR25_CLCINBR0_POSITION               0x00000008
#define _RPINR25_CLCINBR0_MASK                   0x00000100
#define _RPINR25_CLCINBR0_LENGTH                 0x00000001

#define _RPINR25_CLCINBR1_POSITION               0x00000009
#define _RPINR25_CLCINBR1_MASK                   0x00000200
#define _RPINR25_CLCINBR1_LENGTH                 0x00000001

#define _RPINR25_CLCINBR2_POSITION               0x0000000A
#define _RPINR25_CLCINBR2_MASK                   0x00000400
#define _RPINR25_CLCINBR2_LENGTH                 0x00000001

#define _RPINR25_CLCINBR3_POSITION               0x0000000B
#define _RPINR25_CLCINBR3_MASK                   0x00000800
#define _RPINR25_CLCINBR3_LENGTH                 0x00000001

#define _RPINR25_CLCINBR4_POSITION               0x0000000C
#define _RPINR25_CLCINBR4_MASK                   0x00001000
#define _RPINR25_CLCINBR4_LENGTH                 0x00000001

#define _RPINR25_CLCINBR5_POSITION               0x0000000D
#define _RPINR25_CLCINBR5_MASK                   0x00002000
#define _RPINR25_CLCINBR5_LENGTH                 0x00000001

#define _RPINR27_U4RXR_POSITION                  0x00000000
#define _RPINR27_U4RXR_MASK                      0x0000003F
#define _RPINR27_U4RXR_LENGTH                    0x00000006

#define _RPINR27_U4CTSR_POSITION                 0x00000008
#define _RPINR27_U4CTSR_MASK                     0x00003F00
#define _RPINR27_U4CTSR_LENGTH                   0x00000006

#define _RPINR27_U4RXR0_POSITION                 0x00000000
#define _RPINR27_U4RXR0_MASK                     0x00000001
#define _RPINR27_U4RXR0_LENGTH                   0x00000001

#define _RPINR27_U4RXR1_POSITION                 0x00000001
#define _RPINR27_U4RXR1_MASK                     0x00000002
#define _RPINR27_U4RXR1_LENGTH                   0x00000001

#define _RPINR27_U4RXR2_POSITION                 0x00000002
#define _RPINR27_U4RXR2_MASK                     0x00000004
#define _RPINR27_U4RXR2_LENGTH                   0x00000001

#define _RPINR27_U4RXR3_POSITION                 0x00000003
#define _RPINR27_U4RXR3_MASK                     0x00000008
#define _RPINR27_U4RXR3_LENGTH                   0x00000001

#define _RPINR27_U4RXR4_POSITION                 0x00000004
#define _RPINR27_U4RXR4_MASK                     0x00000010
#define _RPINR27_U4RXR4_LENGTH                   0x00000001

#define _RPINR27_U4RXR5_POSITION                 0x00000005
#define _RPINR27_U4RXR5_MASK                     0x00000020
#define _RPINR27_U4RXR5_LENGTH                   0x00000001

#define _RPINR27_U4CTSR0_POSITION                0x00000008
#define _RPINR27_U4CTSR0_MASK                    0x00000100
#define _RPINR27_U4CTSR0_LENGTH                  0x00000001

#define _RPINR27_U4CTSR1_POSITION                0x00000009
#define _RPINR27_U4CTSR1_MASK                    0x00000200
#define _RPINR27_U4CTSR1_LENGTH                  0x00000001

#define _RPINR27_U4CTSR2_POSITION                0x0000000A
#define _RPINR27_U4CTSR2_MASK                    0x00000400
#define _RPINR27_U4CTSR2_LENGTH                  0x00000001

